In [7]:
import pandas as pd

series = pd.Series([2,3,5,6,88,1],dtype='float32')
print(series)

0     2.0
1     3.0
2     5.0
3     6.0
4    88.0
5     1.0
dtype: float32

In [3]:
series.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
series.keys

<bound method Series.keys of 0     2.0
1     3.0
2     5.0
3     6.0
4    88.0
5     1.0
dtype: float32>

In [9]:
series.values

array([ 2.,  3.,  5.,  6., 88.,  1.], dtype=float32)

# Indexing of series

In [13]:
series.index = [1,1,2,3,3,4]##replaces the index of the series##acts as a dictionary but is not a dictionary
series[1]

1    2.0
1    3.0
dtype: float32

In [18]:
import pandas as pd

series = pd.Series(["a","x",1])
print(series.dtype)##becomes object when string brought into it

object

# generating series from a dictionary

In [21]:
age = { "Mina":10, "Ritu":20, "Nisha":20}
age = pd.Series(age)
print(age)

Mina     10
Ritu     20
Nisha    20
dtype: int64

In [24]:
print(age[1:2])##slicing

Ritu    20
dtype: int64

# Comprehension

In [33]:
answer = pd.Series("a",index = [num for num in range(1,5)])
print(answer)

1    a
2    a
3    a
4    a
dtype: object

In [34]:
a = pd.Series([1,2,3,4])
b = pd.Series([5,6,7,8,9])

a+b

0     6.0
1     8.0
2    10.0
3    12.0
4     NaN
dtype: float64

In [36]:
x = pd.concat([a,b])
x

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
4    9
dtype: int64

In [43]:
x = pd.concat([a,b],axis=1)
x

     0  1
0  1.0  5
1  2.0  6
2  3.0  7
3  4.0  8
4  NaN  9

In [56]:
a = pd.Series([12,33,45,44,89,98])
b = pd.Series(["Ainu","Minu","Rita","Reena","Ritu","Sima"])
df = pd.DataFrame({"Name":b,"Age":a})
df

    Name  Age
0   Ainu   12
1   Minu   33
2   Rita   45
3  Reena   44
4   Ritu   89
5   Sima   98

In [55]:
df.to_csv("Data.csv")##can also be stored in other format

In [58]:
df.head()##shows the data upto top 5

    Name  Age
0   Ainu   12
1   Minu   33
2   Rita   45
3  Reena   44
4   Ritu   89

In [66]:
df[df['Age']>80]

   Name  Age
4  Ritu   89
5  Sima   98

In [64]:
df.tail(n=2)

   Name  Age
4  Ritu   89
5  Sima   98